// Задание 1
// Создать переменные num1, num2 которые пользователь вводит с клавиатуры
// Проверьте, что переменная num1 равна или меньше 1, а переменная num2 больше или равна 3.

// const num1 = +prompt("Введите первое число ");
// const num2 = +prompt("Введите второе число ");
// if (num1 <= 1 && num2 >= 3) {
//     console.log(`Да`);
// } else {
//     console.log(`Нет`);
// }



// Задание 2
// Перепишите код к тернарному оператору

// let test = true;
// if (test === true) {
// console.log('+++');
// } else {
// console.log('---');
// }

// let test = true;
// (test === true) ? console.log('+++') : console.log('---');



// Задание 3
// В переменной day лежит какое-то число из интервала от 1 до 31. Определите в какую декаду месяца попадает это число (в первую, вторую или третью).

// let day = +prompt(`Введите число от 1 до 31`);
// if (day <= 10) {
//     console.log(`Первая декада`);
// } else if (day > 10 && day <= 20) {
//     console.log(`Вторая декада`);
// } else if (day > 20 && day <= 31) {
//     console.log(`Третья декада`);
// }


